{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/helene.deribaupierre/Library/Caches/pypoetry/virtualenvs/seminaire-2022-4lsZ7u0L-py3.10/lib/python3.10/site-packages/tqdm/auto.py:22: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import neo4j as neo\n",
    "import matplotlib.pyplot as plt\n",
    "plt.rcParams['figure.figsize'] = [15, 10]\n",
    "import seaborn as sns\n",
    "from graphdatascience import GraphDataScience\n",
    "from sklearn.preprocessing import StandardScaler"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## CONNECTION WITH NEO4J DATABASE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.2.2\n"
     ]
    }
   ],
   "source": [
    "host = \"bolt://44.204.150.95:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"cakes-resident-pans\"\n",
    "\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "\n",
    "print(gds.version())"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#  Variables to initialise"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Information Systems',\n",
       " 'Computer Software',\n",
       " 'Data Format',\n",
       " 'Artificial Intelligence and Image Processing',\n",
       " 'Computation Theory and Mathematics',\n",
       " 'Other Information and Computing Sciences',\n",
       " 'Library and Information Studies',\n",
       " 'Computer Hardware']"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "field_computer_science = [\"Information Systems\",\"Computer Software\",\"Data Format\",\n",
    "\"Artificial Intelligence and Image Processing\",\"Computation Theory and Mathematics\",\"Other Information and Computing Sciences\",\n",
    "\"Library and Information Studies\",\"Computer Hardware\"]\n",
    "field_computer_science"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "researcher_1=\"Jean-Henry Morin\"\n",
    "researcher_2=\"Gilles Falquet\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.set_option('display.max_columns', None)\n",
    "pd.set_option('display.max_colwidth', None)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### METADATA OF THE GRAPH"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "gds.run_cypher(\"CALL db.schema.nodeTypeProperties()\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Some metadata\n",
    "gds.run_cypher(\"CALL db.schema.relTypeProperties()\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### GET THE SCIENTISTS WITH THE MOST PUBLICATIONS IN THE DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Get the scientits in unige with the most publications\n",
    "\n",
    "result_total_publications= gds.run_cypher(\"MATCH (r:Researcher)-[w:WORKS_IN]-(f:Field) RETURN r.full_name as name, r.researcher_id as researcher_id, r.total_number_of_publications as total, \\\n",
    "collect (f.domain) ORDER BY r.total_number_of_publications DESC LIMIT 80\")\n",
    "result_total_publications.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result_total_publications_map = gds.run_cypher(\"MATCH (r:Researcher)-[w:WORKS_IN]-(f:Field) RETURN r.full_name, \\\n",
    "r.total_number_of_publications as total, collect({number:w.number_of_publication,field:f.domain}) as field_number ORDER BY total DESC LIMIT 10\")\n",
    "result_total_publications_map.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "g = sns.barplot(x=result_total_publications[\"name\"], y=result_total_publications[\"total\"])\n",
    "g = g.set_xticklabels(g.get_xticklabels(), rotation=90)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## WHO IS K.CENZUAL????\n",
    "When the data is weird like this, normally you investigate."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.set_option('display.max_columns', None)\n",
    "pd.set_option('display.max_colwidth', None)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "CENZUAL = gds.run_cypher(\"MATCH (n:Researcher{researcher_id:'ur.014174005714.85'})-[:WORKS_IN]-(f:Field) return n.full_name, n.last_name, n.total_number_of_publications, collect(f.domain)\")\n",
    "CENZUAL"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Number of publication in an domain of research"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Get the field which has the most publications\n",
    "result_domain_count = gds.run_cypher(\"MATCH (r:Researcher)-[w:WORKS_IN]-(f:Field) RETURN f.domain as domain, count(*) as number_time ORDER BY  number_time DESC LIMIT 40\")\n",
    "result_domain_count.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "g = sns.barplot(x=result_domain_count[\"domain\"], y=result_domain_count[\"number_time\"])\n",
    "g =g.set_xticklabels(g.get_xticklabels(), rotation=90)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Who published in the most area of research"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Get the researcher that works in several research fields.\n",
    "result_field = gds.run_cypher(\"MATCH (r:Researcher)-[w:WORKS_IN]-(f:Field) RETURN r.full_name as name, r.researcher_id as researcher_id, count(*) as fields ORDER BY  fields DESC LIMIT 30\")\n",
    "result_field.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "g = sns.barplot(x=result_field[\"name\"], y=result_field[\"fields\"])\n",
    "g = g.set_xticklabels(g.get_xticklabels(), rotation=90)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "choppard = gds.run_cypher(\"MATCH (r:Researcher{researcher_id:'ur.016275067565.80'})-[w:WORKS_IN]-(f:Field) RETURN r.full_name as full_name, count(*) as total_fields, collect(f.domain) as domain\")\n",
    "\n",
    "print(choppard.domain)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Computer science"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Scientists with the most publications in Computer Science (areas)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Get the researcher with the most publications in Computer Science \n",
    "\n",
    "query_number_publications_in_computer_science_person =f\"MATCH(r:Researcher)-[w:WORKS_IN]-(f:Field) WHERE f.domain IN {field_computer_science} \\\n",
    "    and w.weight_field > 1 return distinct r.full_name as name,r.researcher_id as researcher_id, r.total_number_of_publications as total_publication ORDER by r.total_number_of_publications DESC\"\n",
    "\n",
    "result_number_publication_person_computer_science = gds.run_cypher(query_number_publications_in_computer_science_person)\n",
    "result_number_publication_person_computer_science.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_informatique_fields = (f\"MATCH(n:Researcher)-[w:WORKS_IN]-(f:Field) WHERE f.domain \\\n",
    "     IN {field_computer_science}  RETURN DISTINCT n.full_name, n.researcher_id as researcher, f.domain, w.weight_field ORDER by w.weight_field DESC\")\n",
    "\n",
    "result_informatique_field = gds.run_cypher(query_informatique_fields)\n",
    "result_informatique_field.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Get the researcher that works in several research fields.\n",
    "result_field = gds.run_cypher(f\"MATCH (r:Researcher)-[w:WORKS_IN]-(f:Field) WHERE f.domain \\\n",
    "IN {field_computer_science} and w.weight_field > 5 with r,f,w MATCH (r)-[ww:WORKS_IN]-(ff:Field)  \\\n",
    "RETURN r.full_name,r.researcher_id as researcher_id, r.total_number_of_publications as total_publication,max(w.weight_field) as max_weight_field, \\\n",
    "collect( DISTINCT f.domain) as domain_computer, \\\n",
    "count(ff.domain) as count_all_domain, collect(ff.domain) as all_domain  \\\n",
    "ORDER BY total_publication DESC \")\n",
    "result_field.head(20)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Start of the Recommender "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Start for the graph algorithms to skip if these relationships are already in the DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_name = \"co_authors_graph\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = gds.run_cypher(\"\"\"CALL gds.graph.drop($params,false) YIELD graphName\"\"\",params={\"params\":graph_name}) # drop the graph and do not raise the error if the graph is not found.\n",
    "result = gds.run_cypher(\"\"\"CALL gds.graph.project($params, 'Researcher', 'CO_AUTHORS')\"\"\",params={\"params\":graph_name})\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Centrality\n",
    "Utiliser les algorithmes de centralités pour calculer les chercheurs qui ont plus de connection (plus important) que d'autres. Ceci pourrait être utiliser plus tard pour classifier les reviewers."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Calculate the Degree Centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Stream the result for the degree centrality \n",
    "\n",
    "result = gds.run_cypher(\n",
    "f\" CALL gds.degree.stream($params) YIELD nodeId, score RETURN gds.util.asNode(nodeId).full_name AS name, score ORDER BY score DESC, name ASC\", params={\"params\":graph_name}\n",
    ")\n",
    "result.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#write the data in the graph\n",
    "result = gds.run_cypher(f\"CALL gds.degree.write($params_graph, {{writeProperty: 'degree_centrality'}})\",params={\"params_graph\":graph_name})\n",
    "result\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Difference between centrality and betweeeness measures\n",
    "\n",
    "Degree centrality measures the number of incoming or outgoing (or both) relationships from a node, depending on the orientation of a relationship projection.\n",
    "\n",
    "Betweenness centrality is a way of detecting the amount of influence a node has over the flow of information in a graph. It is often used to find nodes that serve as a bridge from one part of a graph to another."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# #difficult to run on AURO DS\n",
    "# result_betweeness = gds.run_cypher(\n",
    "# f\" CALL gds.betweenness.write($params_graph, {{writeProperty: 'betweeness'}})\",params={\"params_graph\":graph_name})\n",
    "# result_betweeness\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Calculate PageRank\n",
    "The PageRank algorithm measures the importance of each node within the graph, based on the number \n",
    "incoming relationships and the importance of the corresponding source nodes. \n",
    "The underlying assumption roughly speaking is that a page is only as important as the pages that link to it.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result_page_rank_stream = gds.run_cypher(\n",
    "f\" CALL gds.pageRank.stream($params)\\\n",
    "YIELD nodeId, score \\\n",
    "RETURN gds.util.asNode(nodeId).full_name AS name, score \\\n",
    "ORDER BY score DESC, name ASC\" , params={\"params\":graph_name}\n",
    ")\n",
    "result_page_rank_stream.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result_page_rank_write = gds.run_cypher(\n",
    "f\" CALL gds.pageRank.write($params_graph, {{writeProperty: 'pageRank',scaler:'MinMax'}})\",params={\"params_graph\":graph_name})\n",
    "result_page_rank_write"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Query the database for pageRank and Degree centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "betweeness_page_rank_df = gds.run_cypher(f\"MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) WHERE f.domain IN {field_computer_science} and \\\n",
    "    w.weight_field>1 return DISTINCT n.full_name, n.researcher_id, n.pageRank as pageRank,n.degree_centrality as centrality_score ORDER by pageRank DESC\")\n",
    "betweeness_page_rank_df\n",
    "\n",
    "#centrality_df = gds.run_cypher(f\"MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) WHERE f.domain IN {field_computer_science} and w.weight_field>3 return DISTINCT n.full_name,  n.researcher_id, n.degree_centrality as centrality_score ORDER by centrality_score  DESC\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "scaler = StandardScaler()\n",
    "betweeness_page_rank_df.iloc[:,2:] = scaler.fit_transform(betweeness_page_rank_df.iloc[:,2:].to_numpy())\n",
    "betweeness_page_rank_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#betweeness_page_rank_df.iloc[:,2:]= betweeness_page_rank_df.iloc[:,2:].transform(lambda x: x / abs(x).max())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "betweeness_page_rank_df.fillna(0,inplace=True)\n",
    "betweeness_page_rank_df.set_index(\"n.full_name\",inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "betweeness_page_rank_df.sort_values(by=\"centrality_score\",ascending=False,inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "fig, (ax1,ax2) = plt.subplots(1,2, figsize=(16,8))\n",
    "betweeness_page_rank_df[[\"centrality_score\"]].head(30).plot(kind=\"bar\", ax=ax1)\n",
    "betweeness_page_rank_df[[\"pageRank\"]].head(30).plot(kind=\"bar\",ax=ax2)\n",
    "a = ax1.set_xticklabels(ax1.get_xticklabels(), rotation=90)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The Degree Centrality algorithm counts the number of incoming and outgoing relationships from a node. It is used to find popular nodes in a graph.\n",
    "\n",
    "PageRank is a variant of the Eigenvector Centrality algorithm which measures the transitive (or directional) influence of nodes. Relationships to high-scoring nodes contribute more to the score of a node than connections to low-scoring nodes. A high score means that a node is connected to other nodes that have high scores.\n",
    "\n",
    "On peut remarquer que les mesures ne donnent pas les mêmes résultats. La question est de savoir quel algorithmes choisir, et cela se fait en fonction de ce que l'on veut faire, et des hypotheses de départ.\n",
    "Par exemple, si on recherche un scientifique qui est un hub on va choisir Betweenness Centrality comme algorithme.\n",
    "Entre ces deux exemples, PageRank et centrality, on voit que certains scientifiques on un score PageRank plus haut que leur score de centrality, ou plus bas. Cela pourrait être du au fait que les personnes avec qui ces scientifiques collaborent sont des personnes qui sont \"importante\" ou peu \"importante\". Un·e scientifique qui collabore surtout avec des étudiants en Doctorat va avoir un PageRank score plus bas que quelqu'un qui collabore surtout avec des scientifiques de renoms."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "betweeness_page_rank_df[betweeness_page_rank_df.index.str.startswith(\"Jean-Henry\")]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "betweeness_page_rank_df[betweeness_page_rank_df.index.str.startswith(\"Hélène\")]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "betweeness_page_rank_df[betweeness_page_rank_df.index.str.startswith(\"Nadia Magnenat-Thalmann\")]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## COMMUNITY\n",
    "\n",
    "The Label Propagation algorithm (LPA) is a fast algorithm for finding communities in a graph. It detects these communities using network structure alone as its guide, and doesn’t require a pre-defined objective function or prior information about the communities.\n",
    "LPA works by propagating labels throughout the network and forming communities based on this process of label propagation.\n",
    "The intuition behind the algorithm is that a single label can quickly become dominant in a densely connected group of nodes, but will have trouble crossing a sparsely connected region. Labels will get trapped inside a densely connected group of nodes, and those nodes that end up with the same label when the algorithms finish can be considered part of the same community.\n",
    "\n",
    "The Louvain method is an algorithm to detect communities in large networks. It maximizes a modularity score for each community, where the modularity quantifies the quality of an assignment of nodes to communities. This means evaluating how much more densely connected the nodes within a community are, compared to how connected they would be in a random network. (source neo4j)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_name_2 = \"co_authors_graph_weight\"\n",
    "result = gds.run_cypher(\"\"\"CALL gds.graph.drop($params,false) YIELD graphName\"\"\",params={\"params\":graph_name_2}) # drop the graph and do not raise the error if the graph is not found.\n",
    "result = gds.run_cypher(\"\"\"CALL gds.graph.project('co_authors_graph_weight', 'Researcher', {CO_AUTHORS:{properties:\"number_of_time\"}})\"\"\",params={\"params\":graph_name_2})\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#LabelPropation with weight\n",
    "gds.run_cypher(\"\"\"CALL gds.labelPropagation.stats($graph_name,{maxIterations:22})\n",
    "YIELD communityCount, ranIterations, didConverge\"\"\",params={\"graph_name\":graph_name_2})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#labelPropagation without weight\n",
    "gds.run_cypher(\"\"\"CALL gds.labelPropagation.stats($graph_name,{maxIterations:22})\n",
    "YIELD communityCount, ranIterations, didConverge\"\"\",params={\"graph_name\":graph_name})\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "gds.run_cypher(\"\"\"CALL gds.labelPropagation.stream($graph_name,{relationshipWeightProperty:\"number_of_time\",maxIterations:20})\n",
    "YIELD nodeId, communityId AS Community\n",
    "RETURN gds.util.asNode(nodeId).full_name AS Name, Community\n",
    "ORDER BY Community, Name\"\"\",params={\"graph_name\":graph_name_2})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Louvain with weight\n",
    "gds.run_cypher(\"\"\"\n",
    "CALL gds.louvain.stats($graph_name,{relationshipWeightProperty:\"number_of_time\",maxIterations:22})\n",
    "YIELD communityCount\"\"\",params={\"graph_name\":graph_name_2})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Louvain without weight\n",
    "gds.run_cypher(\"\"\"\n",
    "CALL gds.louvain.stats($graph_name)\n",
    "YIELD communityCount\"\"\",params={\"graph_name\":graph_name_2})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Label propagation\n",
    "gds.run_cypher(\"\"\"CALL gds.labelPropagation.stream($graph_name,{relationshipWeightProperty:\"number_of_time\",maxIterations:20})\n",
    "YIELD nodeId, communityId AS Community\n",
    "RETURN gds.util.asNode(nodeId).full_name AS Name, Community\n",
    "ORDER BY Community, Name\"\"\",params={\"graph_name\":graph_name_2})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#LOUVAIN\n",
    "\n",
    "gds.run_cypher(\"\"\"\n",
    "CALL gds.louvain.stream($graph_name)\n",
    "YIELD nodeId, communityId, intermediateCommunityIds\n",
    "RETURN gds.util.asNode(nodeId).full_name AS full_name, communityId, intermediateCommunityIds\n",
    "ORDER BY full_name ASC\"\"\",params={\"graph_name\":graph_name_2})\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result_write_louvain = gds.run_cypher(\"\"\"\n",
    "CALL gds.louvain.write($graph_name,{relationshipWeightProperty:\"number_of_time\", writeProperty:\"louvain\"})\n",
    "YIELD communityCount, modularity, modularities\"\"\",params={\"graph_name\":graph_name_2})\n",
    "result_write_louvain.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeProjection</th>\n",
       "      <th>relationshipProjection</th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>relationshipCount</th>\n",
       "      <th>projectMillis</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'Researcher': {'label': 'Researcher', 'proper...</td>\n",
       "      <td>{'WORKS_IN_SIMILAR_AREA': {'orientation': 'NAT...</td>\n",
       "      <td>field_weight</td>\n",
       "      <td>64849</td>\n",
       "      <td>1212027</td>\n",
       "      <td>600</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      nodeProjection  \\\n",
       "0  {'Researcher': {'label': 'Researcher', 'proper...   \n",
       "\n",
       "                              relationshipProjection     graphName  nodeCount  \\\n",
       "0  {'WORKS_IN_SIMILAR_AREA': {'orientation': 'NAT...  field_weight      64849   \n",
       "\n",
       "   relationshipCount  projectMillis  \n",
       "0            1212027            600  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_name_3 = \"field_weight\"\n",
    "result = gds.run_cypher(\"\"\"CALL gds.graph.drop($params,false) YIELD graphName\"\"\",params={\"params\":graph_name_3}) # drop the graph and do not raise the error if the graph is not found.\n",
    "result = gds.run_cypher(\"\"\"CALL gds.graph.project($params, 'Researcher','WORKS_IN_SIMILAR_AREA')\"\"\",params={\"params\":graph_name_3})\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "gds.run_cypher(\"\"\"\n",
    "CALL gds.louvain.stream($graph_name)\n",
    "YIELD nodeId, communityId, intermediateCommunityIds\n",
    "RETURN gds.util.asNode(nodeId).full_name AS full_name, communityId, intermediateCommunityIds\n",
    "ORDER BY full_name ASC\"\"\",params={\"graph_name\":graph_name_3})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result_write_louvain_field = gds.run_cypher(\"\"\"\n",
    "CALL gds.louvain.write($graph_name,{ writeProperty:\"louvain_field\"})\n",
    "YIELD communityCount, modularity, modularities\"\"\",params={\"graph_name\":graph_name_3})\n",
    "result_write_louvain_field.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Begining of the query for the result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>louvain</th>\n",
       "      <th>co_authors_list</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1876</td>\n",
       "      <td>[Michel Lauria]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2249</td>\n",
       "      <td>[Cedric Crettaz]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>4125</td>\n",
       "      <td>[Nicolas Zufferey, Jean-Marc Seigneur, C. Bryce, Dimitri Konstantas, Jean-Henry Morin, Chrislain Razafimahefa, Naoufel Cheikhrouhou, Carlos Ballester Lafuente, Michel Deriaz, Verena Kantere, Katarzyna Wac, Matteo Ciman, Simon Thevenin]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4855</td>\n",
       "      <td>[Yves Wiaux]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>6833</td>\n",
       "      <td>[Gregg Vanderheiden]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>8038</td>\n",
       "      <td>[Stéphane Marchand-Maillet, Edgar Roman-Rangel, Hisham Mohamed, Eric Bruno]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>14970</td>\n",
       "      <td>[Yin Wu]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>19829</td>\n",
       "      <td>[Flavia Donno, Erwin Laure, Ian Willers, Matteo Risoldi, Vladimir Loncar]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>24562</td>\n",
       "      <td>[Ahmad Din]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>26571</td>\n",
       "      <td>[Giovanna Di Marzo Serugendo, Didier Buchs, Luis Pedro, Dimitri Racordon, Abdelaziz Khadraoui, Nicolas Ray, Pierre Lacroix, Gilles Falquet, Gregory Giuliani, Jose Luis Fernandez-Marquez, Jolita Ralyté, Francesco Luca De Angelis, Michel Leonard, J. Hulaas, L. Moccozet, Alexis Marechal, Gilbert Ritschard]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>26732</td>\n",
       "      <td>[Lara Srivastava]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>29455</td>\n",
       "      <td>[Emmanuel Fragniere]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>32058</td>\n",
       "      <td>[S. Gil]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>32525</td>\n",
       "      <td>[L. Cardoso]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>34163</td>\n",
       "      <td>[Levi Lucio, Birger Koblitz]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>36017</td>\n",
       "      <td>[E. Tejedor, Guilherme Amadio, J.T. Moscicki, Michal Simon, Alexey Tselishchev, Oliver Keeble, Sünje Dallmeier-Tiessen, Juha Herrala, S. Vallecorsa, María Arsuaga-Ríos]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>37263</td>\n",
       "      <td>[Ahmad R. Shahid, Basit Raza, Khuram Naveed, Syed Saud Naqvi]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>37287</td>\n",
       "      <td>[Nabil Abdennadher, J.M. Le Goff, P Gayet, A. Masi, Keith Kershaw, Marc-Oliver Gewaltig, M. Di Castro]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>40326</td>\n",
       "      <td>[Behrooz Razeghi, Sviatoslav Voloshynovskiy, Oleksiy Koval, Farzad Farhadzadeh, Fokko Beekhof, Frédéric Ehrler, Kurt Stockinger, Henning Müller, Heinz Stockinger, K. Mostaguir, Edouard de Castro, Patrick Masson, Nadia Magnenat-Thalmann, Pierre-André Michel, Frédérique Lisacek, Christian Sigrist, Douglas Teodoro, Petra S. Langendijk-Genevaux, Niels Nijdam, Janna Hastings, A. Geissbuhler, Patrick Ruch, Alexandros Kalousis, F Borst, Julien Gobeill, Alan James Bridge, Julien Mariethoz, Teresa K. Attwood, Catherine Rivoire, Emilie Pasche, C Breant, Jerven Tjalling Bolleman, Alex Bateman, Georges Bediang, Wolfgang Hoschek, T. Pun, Christine Chichester, Rolf Wipfli, J.-R. Scherrer, B. Roechert, Christian Lovis, Nicole Redaschi, Amos Bairoch, Cecilia N. Arighi, Sandra Orchard, R. Baud, Peter Kunszt, M. Hilario, Cathy Wu, M. Funk, C. Pellegrini, Hyewon Seo, P. Volino, Jimison Iavindrasana, Yazdan Salimi, Jérôme Schmid, Osman Ratib, Olga Taran, George Papagiannakis, S. Voloshynovskiy, Isaac Shiri, Maurits Diephuis, P. Kalra, Sebastian Otálora, RUGGERO MILANESE, Xin Zhou, Tom Molet, Benoît Deville, Henrique G Debarba, Amirhossein Sanaat, Y Ligier, Taras Holotyak, Mohammad Soleymani, Nadia Magnenat Thalmann, Mina Bjelogrlic, A.-L. Veuthey, Dimche Kostadinov, Habib Zaidi, F. A. Kotasidis, I. Pandzic, Patricia Hernandez, Sohrab Ferdowsi, Christian Girard, HOLGER BOSCH, P. Frey, Hossein Arabi, Guido Bologna, Won-Sook Lee, Zerrin Kasap, Adam Woźnica, Lorenzo Campana, Adrien Depeursinge, Frederic Cordier, Yvain Tisserand, Pierrette Bouillon, Azadeh Akhavanallaf, Guillaume Chanel, ABDERRAHIM LABBI]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>42198</td>\n",
       "      <td>[J. Rolim, BASTIEN CHOPARD, Mohamed Ben Belgacem, Pierre Leone, Tapio Niemi, Sébastien Ziegler, Constantinos Marios Angelopoulos, Marko Niinimaki, Giacomo Lunghi, Martin J. Gander]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>42327</td>\n",
       "      <td>[Noria Foukia]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>45112</td>\n",
       "      <td>[Christelle Despont-Gros]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>48081</td>\n",
       "      <td>[Mohamed Bouri]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>49297</td>\n",
       "      <td>[Bob Jones]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>49566</td>\n",
       "      <td>[James Henderson]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>50555</td>\n",
       "      <td>[Nicolas Szilas]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>55785</td>\n",
       "      <td>[Shelby Pereira]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>62607</td>\n",
       "      <td>[Peter Frinking]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    louvain  \\\n",
       "0      1876   \n",
       "1      2249   \n",
       "2      4125   \n",
       "3      4855   \n",
       "4      6833   \n",
       "5      8038   \n",
       "6     14970   \n",
       "7     19829   \n",
       "8     24562   \n",
       "9     26571   \n",
       "10    26732   \n",
       "11    29455   \n",
       "12    32058   \n",
       "13    32525   \n",
       "14    34163   \n",
       "15    36017   \n",
       "16    37263   \n",
       "17    37287   \n",
       "18    40326   \n",
       "19    42198   \n",
       "20    42327   \n",
       "21    45112   \n",
       "22    48081   \n",
       "23    49297   \n",
       "24    49566   \n",
       "25    50555   \n",
       "26    55785   \n",
       "27    62607   \n",
       "\n",
       "                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            co_authors_list  \n",
       "0                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           [Michel Lauria]  \n",
       "1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          [Cedric Crettaz]  \n",
       "2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               [Nicolas Zufferey, Jean-Marc Seigneur, C. Bryce, Dimitri Konstantas, Jean-Henry Morin, Chrislain Razafimahefa, Naoufel Cheikhrouhou, Carlos Ballester Lafuente, Michel Deriaz, Verena Kantere, Katarzyna Wac, Matteo Ciman, Simon Thevenin]  \n",
       "3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              [Yves Wiaux]  \n",
       "4                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      [Gregg Vanderheiden]  \n",
       "5                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               [Stéphane Marchand-Maillet, Edgar Roman-Rangel, Hisham Mohamed, Eric Bruno]  \n",
       "6                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  [Yin Wu]  \n",
       "7                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 [Flavia Donno, Erwin Laure, Ian Willers, Matteo Risoldi, Vladimir Loncar]  \n",
       "8                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               [Ahmad Din]  \n",
       "9                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          [Giovanna Di Marzo Serugendo, Didier Buchs, Luis Pedro, Dimitri Racordon, Abdelaziz Khadraoui, Nicolas Ray, Pierre Lacroix, Gilles Falquet, Gregory Giuliani, Jose Luis Fernandez-Marquez, Jolita Ralyté, Francesco Luca De Angelis, Michel Leonard, J. Hulaas, L. Moccozet, Alexis Marechal, Gilbert Ritschard]  \n",
       "10                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        [Lara Srivastava]  \n",
       "11                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     [Emmanuel Fragniere]  \n",
       "12                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 [S. Gil]  \n",
       "13                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             [L. Cardoso]  \n",
       "14                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             [Levi Lucio, Birger Koblitz]  \n",
       "15                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 [E. Tejedor, Guilherme Amadio, J.T. Moscicki, Michal Simon, Alexey Tselishchev, Oliver Keeble, Sünje Dallmeier-Tiessen, Juha Herrala, S. Vallecorsa, María Arsuaga-Ríos]  \n",
       "16                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            [Ahmad R. Shahid, Basit Raza, Khuram Naveed, Syed Saud Naqvi]  \n",
       "17                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   [Nabil Abdennadher, J.M. Le Goff, P Gayet, A. Masi, Keith Kershaw, Marc-Oliver Gewaltig, M. Di Castro]  \n",
       "18  [Behrooz Razeghi, Sviatoslav Voloshynovskiy, Oleksiy Koval, Farzad Farhadzadeh, Fokko Beekhof, Frédéric Ehrler, Kurt Stockinger, Henning Müller, Heinz Stockinger, K. Mostaguir, Edouard de Castro, Patrick Masson, Nadia Magnenat-Thalmann, Pierre-André Michel, Frédérique Lisacek, Christian Sigrist, Douglas Teodoro, Petra S. Langendijk-Genevaux, Niels Nijdam, Janna Hastings, A. Geissbuhler, Patrick Ruch, Alexandros Kalousis, F Borst, Julien Gobeill, Alan James Bridge, Julien Mariethoz, Teresa K. Attwood, Catherine Rivoire, Emilie Pasche, C Breant, Jerven Tjalling Bolleman, Alex Bateman, Georges Bediang, Wolfgang Hoschek, T. Pun, Christine Chichester, Rolf Wipfli, J.-R. Scherrer, B. Roechert, Christian Lovis, Nicole Redaschi, Amos Bairoch, Cecilia N. Arighi, Sandra Orchard, R. Baud, Peter Kunszt, M. Hilario, Cathy Wu, M. Funk, C. Pellegrini, Hyewon Seo, P. Volino, Jimison Iavindrasana, Yazdan Salimi, Jérôme Schmid, Osman Ratib, Olga Taran, George Papagiannakis, S. Voloshynovskiy, Isaac Shiri, Maurits Diephuis, P. Kalra, Sebastian Otálora, RUGGERO MILANESE, Xin Zhou, Tom Molet, Benoît Deville, Henrique G Debarba, Amirhossein Sanaat, Y Ligier, Taras Holotyak, Mohammad Soleymani, Nadia Magnenat Thalmann, Mina Bjelogrlic, A.-L. Veuthey, Dimche Kostadinov, Habib Zaidi, F. A. Kotasidis, I. Pandzic, Patricia Hernandez, Sohrab Ferdowsi, Christian Girard, HOLGER BOSCH, P. Frey, Hossein Arabi, Guido Bologna, Won-Sook Lee, Zerrin Kasap, Adam Woźnica, Lorenzo Campana, Adrien Depeursinge, Frederic Cordier, Yvain Tisserand, Pierrette Bouillon, Azadeh Akhavanallaf, Guillaume Chanel, ABDERRAHIM LABBI]  \n",
       "19                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     [J. Rolim, BASTIEN CHOPARD, Mohamed Ben Belgacem, Pierre Leone, Tapio Niemi, Sébastien Ziegler, Constantinos Marios Angelopoulos, Marko Niinimaki, Giacomo Lunghi, Martin J. Gander]  \n",
       "20                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           [Noria Foukia]  \n",
       "21                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                [Christelle Despont-Gros]  \n",
       "22                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          [Mohamed Bouri]  \n",
       "23                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              [Bob Jones]  \n",
       "24                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        [James Henderson]  \n",
       "25                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         [Nicolas Szilas]  \n",
       "26                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         [Shelby Pereira]  \n",
       "27                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         [Peter Frinking]  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "louvain_df = gds.run_cypher(f\"MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) WHERE f.domain IN {field_computer_science} and \\\n",
    "w.weight_field>2 return DISTINCT n.full_name, n.louvain as louvain ORDER by louvain DESC\")\n",
    "louvain_df_group = (\n",
    "        louvain_df.groupby(\"louvain\")\n",
    "        .agg(co_authors_list=(\"n.full_name\", \"unique\"))\n",
    "        .reset_index()\n",
    "    )\n",
    "louvain_df_group"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.full_name</th>\n",
       "      <th>louvain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>4125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        n.full_name  louvain\n",
       "0  Jean-Henry Morin     4125\n",
       "1    Gilles Falquet    26571"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#return the community of two scientists\n",
    "louvain_2_scientists = gds.run_cypher(f\"MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) \\\n",
    "WHERE n.full_name=$researcher_1 return DISTINCT n.full_name, n.louvain as louvain \\\n",
    "UNION \\\n",
    "MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) \\\n",
    "WHERE n.full_name=$researcher_2 return DISTINCT n.full_name, n.louvain as louvain\",params={\"researcher_1\":researcher_1,\"researcher_2\":researcher_2})\n",
    "louvain_2_scientists"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>full_name</th>\n",
       "      <th>researcher_id</th>\n",
       "      <th>n.louvain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Paul R. Hunter</td>\n",
       "      <td>ur.01255356036.46</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Michel Leonard</td>\n",
       "      <td>ur.01066422007.20</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Simona Zipursky</td>\n",
       "      <td>ur.01145320545.18</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Alejandro Ramirez Gonzalez</td>\n",
       "      <td>ur.013065015327.56</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Emily Wootton</td>\n",
       "      <td>ur.010031000127.92</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Omar Benkacem</td>\n",
       "      <td>ur.012406460341.25</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Suzanne Scheele</td>\n",
       "      <td>ur.01057413767.46</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>E Allanson</td>\n",
       "      <td>ur.016340266524.30</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Ö Tunçalp</td>\n",
       "      <td>ur.01106661663.19</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>RAMACHANDRA PARARAJASEGARAM</td>\n",
       "      <td>ur.01153035546.55</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>SILVIO P. MARIOTTI</td>\n",
       "      <td>ur.01051350114.89</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>SERGE RESNIKOFF</td>\n",
       "      <td>ur.0741014170.33</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Ayesha Sajjad</td>\n",
       "      <td>ur.0665230070.67</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Rajiv Chowdhury</td>\n",
       "      <td>ur.0624332664.74</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Janine F. Felix</td>\n",
       "      <td>ur.01274405570.17</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Shanthi Mendis</td>\n",
       "      <td>ur.01031463232.10</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Henning Tiemeier</td>\n",
       "      <td>ur.01312451146.19</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Jonathan Mant</td>\n",
       "      <td>ur.0632152067.29</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Oscar H. Franco</td>\n",
       "      <td>ur.01171532202.66</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Anna Newton-Levinson</td>\n",
       "      <td>ur.0770505254.56</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      full_name       researcher_id  n.louvain\n",
       "0                Paul R. Hunter   ur.01255356036.46      26571\n",
       "1                Michel Leonard   ur.01066422007.20      26571\n",
       "2               Simona Zipursky   ur.01145320545.18      26571\n",
       "3    Alejandro Ramirez Gonzalez  ur.013065015327.56      26571\n",
       "4                 Emily Wootton  ur.010031000127.92      26571\n",
       "5                 Omar Benkacem  ur.012406460341.25      26571\n",
       "6               Suzanne Scheele   ur.01057413767.46      26571\n",
       "7                    E Allanson  ur.016340266524.30      26571\n",
       "8                     Ö Tunçalp   ur.01106661663.19      26571\n",
       "9   RAMACHANDRA PARARAJASEGARAM   ur.01153035546.55      26571\n",
       "10           SILVIO P. MARIOTTI   ur.01051350114.89      26571\n",
       "11              SERGE RESNIKOFF    ur.0741014170.33      26571\n",
       "12                Ayesha Sajjad    ur.0665230070.67      26571\n",
       "13              Rajiv Chowdhury    ur.0624332664.74      26571\n",
       "14              Janine F. Felix   ur.01274405570.17      26571\n",
       "15               Shanthi Mendis   ur.01031463232.10      26571\n",
       "16             Henning Tiemeier   ur.01312451146.19      26571\n",
       "17                Jonathan Mant    ur.0632152067.29      26571\n",
       "18              Oscar H. Franco   ur.01171532202.66      26571\n",
       "19         Anna Newton-Levinson    ur.0770505254.56      26571"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#return the researcher that are in the same community than both scientists\n",
    "louvain_other = gds.run_cypher(f\"MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) WHERE n.louvain IN {louvain_2_scientists.louvain.tolist()} \\\n",
    "RETURN DISTINCT n.full_name as full_name, n.researcher_id as researcher_id, n.louvain\")\n",
    "louvain_other.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.full_name</th>\n",
       "      <th>louvain_field</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        n.full_name  louvain_field\n",
       "0  Jean-Henry Morin          31670\n",
       "1    Gilles Falquet          31670"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "louvain_2_scientists_field = gds.run_cypher(f\"MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) \\\n",
    "WHERE n.full_name=$researcher_1 return DISTINCT n.full_name, n.louvain_field as louvain_field \\\n",
    "UNION \\\n",
    "MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) \\\n",
    "WHERE n.full_name=$researcher_2 return DISTINCT n.full_name, n.louvain_field as louvain_field\",params={\"researcher_1\":researcher_1,\"researcher_2\":researcher_2})\n",
    "louvain_2_scientists_field"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(1500, 3)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>full_name</th>\n",
       "      <th>researcher_id</th>\n",
       "      <th>n.louvain_field</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Emmanouil T. Dermitzakis</td>\n",
       "      <td>ur.01204470014.51</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sébastien Ziegler</td>\n",
       "      <td>ur.013523127674.95</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>K H Krause</td>\n",
       "      <td>ur.01132215437.58</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C. Bonadonna</td>\n",
       "      <td>ur.07732455104.21</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Donald Glowinski</td>\n",
       "      <td>ur.07567302507.39</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Michel Leonard</td>\n",
       "      <td>ur.01066422007.20</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Manfred Gilli</td>\n",
       "      <td>ur.010700105653.02</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Elvezio Ronchetti</td>\n",
       "      <td>ur.012507417265.19</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>T. O. Niinikoski</td>\n",
       "      <td>ur.010674443035.14</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>A. Rijllart</td>\n",
       "      <td>ur.01000325115.53</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Annabelle Lever</td>\n",
       "      <td>ur.0770553557.41</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Karl Schaller</td>\n",
       "      <td>ur.01231364424.12</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Omar Benkacem</td>\n",
       "      <td>ur.012406460341.25</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>S. Giani</td>\n",
       "      <td>ur.010474314032.10</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>J. Kašpar</td>\n",
       "      <td>ur.07440162461.83</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>M. Escher</td>\n",
       "      <td>ur.016420137025.13</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Mathieu Nendaz</td>\n",
       "      <td>ur.01321751076.27</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>D. Courvoisier</td>\n",
       "      <td>ur.01007010171.60</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>M. Hilario</td>\n",
       "      <td>ur.010323216605.25</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Ö Tunçalp</td>\n",
       "      <td>ur.01106661663.19</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   full_name       researcher_id  n.louvain_field\n",
       "0   Emmanouil T. Dermitzakis   ur.01204470014.51            31670\n",
       "1          Sébastien Ziegler  ur.013523127674.95            31670\n",
       "2                 K H Krause   ur.01132215437.58            31670\n",
       "3               C. Bonadonna   ur.07732455104.21            31670\n",
       "4           Donald Glowinski   ur.07567302507.39            31670\n",
       "5             Michel Leonard   ur.01066422007.20            31670\n",
       "6              Manfred Gilli  ur.010700105653.02            31670\n",
       "7          Elvezio Ronchetti  ur.012507417265.19            31670\n",
       "8           T. O. Niinikoski  ur.010674443035.14            31670\n",
       "9                A. Rijllart   ur.01000325115.53            31670\n",
       "10           Annabelle Lever    ur.0770553557.41            31670\n",
       "11             Karl Schaller   ur.01231364424.12            31670\n",
       "12             Omar Benkacem  ur.012406460341.25            31670\n",
       "13                  S. Giani  ur.010474314032.10            31670\n",
       "14                 J. Kašpar   ur.07440162461.83            31670\n",
       "15                 M. Escher  ur.016420137025.13            31670\n",
       "16            Mathieu Nendaz   ur.01321751076.27            31670\n",
       "17            D. Courvoisier   ur.01007010171.60            31670\n",
       "18                M. Hilario  ur.010323216605.25            31670\n",
       "19                 Ö Tunçalp   ur.01106661663.19            31670"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#return the researcher that are in the same community than both scientists\n",
    "louvain_other_field = gds.run_cypher(f\"MATCH (n:Researcher)-[w:WORKS_IN]-(f:Field) WHERE n.louvain_field IN {louvain_2_scientists_field.louvain_field.tolist()} \\\n",
    "RETURN DISTINCT n.full_name as full_name, n.researcher_id as researcher_id, n.louvain_field\")\n",
    "print(louvain_other_field.shape)\n",
    "louvain_other_field.head(20)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Inference avec la règle\n",
    "∀x ∀y ∀z ∀f,\u000b\n",
    "co_authors(x,y) ∧\u000b\n",
    "co_authors(y,z) ∧\u000b\n",
    "works_in(x,f) ∧\u000b\n",
    "works_in(z,f) ∧\u000b\n",
    "(weight(z,f)-n) <=\u000b\n",
    "(weight(x,f)<=\u000b\n",
    "(weight(z,f)+n) ∧\u000b\n",
    "(works_in(x,f)>n) ->\u000b\n",
    "possible_reviewers(𝑥,𝑧)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(216, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>reviewer_id</th>\n",
       "      <th>score</th>\n",
       "      <th>full_name_author</th>\n",
       "      <th>reviewer_full_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>259</th>\n",
       "      <td>ur.0704711431.38</td>\n",
       "      <td>14.352</td>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Nadia Magnenat-Thalmann</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>ur.0704711431.38</td>\n",
       "      <td>14.352</td>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Nadia Magnenat-Thalmann</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>287</th>\n",
       "      <td>ur.07552063233.67</td>\n",
       "      <td>11.447</td>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Henning Müller</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>155</th>\n",
       "      <td>ur.013317560667.45</td>\n",
       "      <td>11.164</td>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Nadia Magnenat Thalmann</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>157</th>\n",
       "      <td>ur.013317560667.45</td>\n",
       "      <td>11.164</td>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Nadia Magnenat Thalmann</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>284</th>\n",
       "      <td>ur.07527316741.46</td>\n",
       "      <td>9.674</td>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>P. Volino</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>283</th>\n",
       "      <td>ur.07527316741.46</td>\n",
       "      <td>9.674</td>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>P. Volino</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>136</th>\n",
       "      <td>ur.012722422737.80</td>\n",
       "      <td>9.051</td>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>I. Pandzic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>138</th>\n",
       "      <td>ur.012722422737.80</td>\n",
       "      <td>9.051</td>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>I. Pandzic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>223</th>\n",
       "      <td>ur.016176475704.89</td>\n",
       "      <td>8.784</td>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Patrick Ruch</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            reviewer_id   score  full_name_author       reviewer_full_name\n",
       "259    ur.0704711431.38  14.352  Jean-Henry Morin  Nadia Magnenat-Thalmann\n",
       "261    ur.0704711431.38  14.352    Gilles Falquet  Nadia Magnenat-Thalmann\n",
       "287   ur.07552063233.67  11.447    Gilles Falquet           Henning Müller\n",
       "155  ur.013317560667.45  11.164  Jean-Henry Morin  Nadia Magnenat Thalmann\n",
       "157  ur.013317560667.45  11.164    Gilles Falquet  Nadia Magnenat Thalmann\n",
       "284   ur.07527316741.46   9.674    Gilles Falquet                P. Volino\n",
       "283   ur.07527316741.46   9.674  Jean-Henry Morin                P. Volino\n",
       "136  ur.012722422737.80   9.051  Jean-Henry Morin               I. Pandzic\n",
       "138  ur.012722422737.80   9.051    Gilles Falquet               I. Pandzic\n",
       "223  ur.016176475704.89   8.784    Gilles Falquet             Patrick Ruch"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Paper written by 2 scientists\n",
    "difference_weight_field=10\n",
    "minimum_weight_field=1.0\n",
    "\n",
    "result_inference = gds.run_cypher(f\"UNWIND $full_name as full_name\\\n",
    "        MATCH (res_1:Researcher{{full_name:full_name}}) CALL apoc.neighbors.athop(res_1, 'CO_AUTHORS', 2) \\\n",
    "        yield node as res_2  \\\n",
    "        MATCH (res_1)-[w_1:WORKS_IN]->(f:Field) \\\n",
    "        MATCH (res_2)-[w_2:WORKS_IN]->(f:Field) \\\n",
    "        WHERE (w_2.weight_field-$difference_weight_field)<= w_1.weight_field <=(w_2.weight_field+$difference_weight_field) \\\n",
    "        AND w_1.weight_field > $minimum_weight_field \\\n",
    "        and res_1 <> res_2 \\\n",
    "        RETURN DISTINCT res_1.full_name as full_name_author, res_2.full_name as reviewer_full_name,res_2.researcher_id as reviewer_id, round((w_2.weight_field+w_1.weight_field)/2,3) as score \\\n",
    "        \",params={\"full_name\":[researcher_1,researcher_2],\"difference_weight_field\":difference_weight_field,\"minimum_weight_field\":minimum_weight_field})\n",
    "result_tmp = result_inference.groupby([\"reviewer_id\"]).sum(\"score\")\n",
    "result_merged = result_tmp.merge(result_inference,on=\"reviewer_id\").drop(columns=\"score_y\").rename(columns={\"score_x\":\"score\"}).drop_duplicates()\n",
    "result_merged.sort_values(by=\"score\",ascending=False,inplace=True)\n",
    "print(result_merged.shape)\n",
    "result_merged.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(78, 5)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>full_name_author</th>\n",
       "      <th>reviewer_full_name</th>\n",
       "      <th>reviewer_id</th>\n",
       "      <th>score</th>\n",
       "      <th>n.louvain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Panagiotis Kostopoulos</td>\n",
       "      <td>ur.016265667045.20</td>\n",
       "      <td>2.900</td>\n",
       "      <td>4125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Naoufel Cheikhrouhou</td>\n",
       "      <td>ur.016055002233.13</td>\n",
       "      <td>0.865</td>\n",
       "      <td>4125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Naoufel Cheikhrouhou</td>\n",
       "      <td>ur.016055002233.13</td>\n",
       "      <td>3.096</td>\n",
       "      <td>4125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Athanasios I. Kyritsis</td>\n",
       "      <td>ur.010360176245.76</td>\n",
       "      <td>2.636</td>\n",
       "      <td>4125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Shervin Zakeri</td>\n",
       "      <td>ur.014425412436.05</td>\n",
       "      <td>2.261</td>\n",
       "      <td>4125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Eric Wehrli</td>\n",
       "      <td>ur.01242625577.43</td>\n",
       "      <td>2.474</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Violeta Seretan</td>\n",
       "      <td>ur.015071453432.09</td>\n",
       "      <td>2.135</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Anastasiya Yurchyshyna</td>\n",
       "      <td>ur.013646161477.93</td>\n",
       "      <td>3.183</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Isabelle Bolon</td>\n",
       "      <td>ur.010341730503.86</td>\n",
       "      <td>1.757</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Michel Cotten</td>\n",
       "      <td>ur.01075705617.52</td>\n",
       "      <td>2.808</td>\n",
       "      <td>26571</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>78 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    full_name_author      reviewer_full_name         reviewer_id  score  \\\n",
       "16  Jean-Henry Morin  Panagiotis Kostopoulos  ur.016265667045.20  2.900   \n",
       "19  Jean-Henry Morin    Naoufel Cheikhrouhou  ur.016055002233.13  0.865   \n",
       "18  Jean-Henry Morin    Naoufel Cheikhrouhou  ur.016055002233.13  3.096   \n",
       "17  Jean-Henry Morin  Athanasios I. Kyritsis  ur.010360176245.76  2.636   \n",
       "32  Jean-Henry Morin          Shervin Zakeri  ur.014425412436.05  2.261   \n",
       "..               ...                     ...                 ...    ...   \n",
       "43    Gilles Falquet             Eric Wehrli   ur.01242625577.43  2.474   \n",
       "44    Gilles Falquet         Violeta Seretan  ur.015071453432.09  2.135   \n",
       "45    Gilles Falquet  Anastasiya Yurchyshyna  ur.013646161477.93  3.183   \n",
       "49    Gilles Falquet          Isabelle Bolon  ur.010341730503.86  1.757   \n",
       "77    Gilles Falquet           Michel Cotten   ur.01075705617.52  2.808   \n",
       "\n",
       "    n.louvain  \n",
       "16       4125  \n",
       "19       4125  \n",
       "18       4125  \n",
       "17       4125  \n",
       "32       4125  \n",
       "..        ...  \n",
       "43      26571  \n",
       "44      26571  \n",
       "45      26571  \n",
       "49      26571  \n",
       "77      26571  \n",
       "\n",
       "[78 rows x 5 columns]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result_merged_louvain_inference = result_inference.merge(louvain_other, left_on=\"reviewer_id\",right_on=\"researcher_id\").drop(columns=[\"researcher_id\",\"full_name\"]).sort_values(by=\"n.louvain\")\n",
    "print(result_merged_louvain_inference.shape)\n",
    "result_merged_louvain_inference\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_co_authors_by_name(names: list[str]):\n",
    "        query = \"\"\"\n",
    "        UNWIND $researchers as name\n",
    "        MATCH (r:Researcher{full_name: name})-[c:CO_AUTHORS]-(p:Researcher) \n",
    "        WHERE r<>p\n",
    "        RETURN DISTINCT p.researcher_id,p.full_name\n",
    "        \"\"\"\n",
    "        return gds.run_cypher(\n",
    "            query,\n",
    "            params={\"researchers\": names},\n",
    "        )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.researcher_id</th>\n",
       "      <th>p.full_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ur.0643632165.06</td>\n",
       "      <td>Dimitri Konstantas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ur.013104610033.47</td>\n",
       "      <td>Katerina Stamou</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ur.011260202163.33</td>\n",
       "      <td>Verena Kantere</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ur.014140374103.20</td>\n",
       "      <td>Vassilis Prevelakis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ur.07350022537.69</td>\n",
       "      <td>C. Bryce</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ur.015572001267.73</td>\n",
       "      <td>Antonella Longo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ur.014177040267.27</td>\n",
       "      <td>Mario Bochicchio</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ur.015372375037.57</td>\n",
       "      <td>L. Moccozet</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ur.010456151764.35</td>\n",
       "      <td>Jörn Erbguth</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ur.015271360627.89</td>\n",
       "      <td>Matteo Risoldi</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      p.researcher_id          p.full_name\n",
       "0    ur.0643632165.06   Dimitri Konstantas\n",
       "1  ur.013104610033.47      Katerina Stamou\n",
       "2  ur.011260202163.33       Verena Kantere\n",
       "3  ur.014140374103.20  Vassilis Prevelakis\n",
       "4   ur.07350022537.69             C. Bryce\n",
       "5  ur.015572001267.73      Antonella Longo\n",
       "6  ur.014177040267.27     Mario Bochicchio\n",
       "7  ur.015372375037.57          L. Moccozet\n",
       "8  ur.010456151764.35         Jörn Erbguth\n",
       "9  ur.015271360627.89       Matteo Risoldi"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "co_authors = query_co_authors_by_name(result_merged_louvain_inference.full_name_author.drop_duplicates().tolist())\n",
    "co_authors.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(177, 5)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>full_name_author</th>\n",
       "      <th>reviewer_full_name</th>\n",
       "      <th>reviewer_id</th>\n",
       "      <th>score</th>\n",
       "      <th>n.louvain_field</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Nadia Magnenat-Thalmann</td>\n",
       "      <td>ur.0704711431.38</td>\n",
       "      <td>6.998</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Michel Leonard</td>\n",
       "      <td>ur.01066422007.20</td>\n",
       "      <td>5.602</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Christian Lovis</td>\n",
       "      <td>ur.01133331655.52</td>\n",
       "      <td>4.553</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>P. Volino</td>\n",
       "      <td>ur.07527316741.46</td>\n",
       "      <td>4.473</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>M. Hilario</td>\n",
       "      <td>ur.010323216605.25</td>\n",
       "      <td>4.454</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Michel Leonard</td>\n",
       "      <td>ur.01066422007.20</td>\n",
       "      <td>0.990</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Katarzyna Wac</td>\n",
       "      <td>ur.010234164203.55</td>\n",
       "      <td>0.985</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Naoufel Cheikhrouhou</td>\n",
       "      <td>ur.016055002233.13</td>\n",
       "      <td>0.865</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>I. Pandzic</td>\n",
       "      <td>ur.012722422737.80</td>\n",
       "      <td>0.849</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Nadia Magnenat-Thalmann</td>\n",
       "      <td>ur.0704711431.38</td>\n",
       "      <td>0.807</td>\n",
       "      <td>31670</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>177 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    full_name_author       reviewer_full_name         reviewer_id  score  \\\n",
       "11    Gilles Falquet  Nadia Magnenat-Thalmann    ur.0704711431.38  6.998   \n",
       "1   Jean-Henry Morin           Michel Leonard   ur.01066422007.20  5.602   \n",
       "67    Gilles Falquet          Christian Lovis   ur.01133331655.52  4.553   \n",
       "8     Gilles Falquet                P. Volino   ur.07527316741.46  4.473   \n",
       "50    Gilles Falquet               M. Hilario  ur.010323216605.25  4.454   \n",
       "..               ...                      ...                 ...    ...   \n",
       "0   Jean-Henry Morin           Michel Leonard   ur.01066422007.20  0.990   \n",
       "16  Jean-Henry Morin            Katarzyna Wac  ur.010234164203.55  0.985   \n",
       "31  Jean-Henry Morin     Naoufel Cheikhrouhou  ur.016055002233.13  0.865   \n",
       "32  Jean-Henry Morin               I. Pandzic  ur.012722422737.80  0.849   \n",
       "10  Jean-Henry Morin  Nadia Magnenat-Thalmann    ur.0704711431.38  0.807   \n",
       "\n",
       "    n.louvain_field  \n",
       "11            31670  \n",
       "1             31670  \n",
       "67            31670  \n",
       "8             31670  \n",
       "50            31670  \n",
       "..              ...  \n",
       "0             31670  \n",
       "16            31670  \n",
       "31            31670  \n",
       "32            31670  \n",
       "10            31670  \n",
       "\n",
       "[177 rows x 5 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result_merged_louvain_inference_field = result_inference.merge(louvain_other_field, left_on=\"reviewer_id\",right_on=\"researcher_id\").drop(columns=[\"researcher_id\",\"full_name\"]).sort_values(by=\"n.louvain_field\")\n",
    "print(result_merged_louvain_inference_field.shape)\n",
    "result_merged_louvain_inference_field.sort_values(by=\"score\", ascending=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>full_name_author</th>\n",
       "      <th>reviewer_full_name</th>\n",
       "      <th>reviewer_id</th>\n",
       "      <th>score</th>\n",
       "      <th>n.louvain</th>\n",
       "      <th>p.researcher_id</th>\n",
       "      <th>p.full_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>ur.016167755437.37</td>\n",
       "      <td>4.318</td>\n",
       "      <td>26571</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>ur.0631021307.20</td>\n",
       "      <td>4.318</td>\n",
       "      <td>4125</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Jolita Ralyté</td>\n",
       "      <td>ur.012265620367.64</td>\n",
       "      <td>4.246</td>\n",
       "      <td>26571</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Jose Luis Fernandez-Marquez</td>\n",
       "      <td>ur.013262732566.50</td>\n",
       "      <td>4.108</td>\n",
       "      <td>26571</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Giovanna Di Marzo Serugendo</td>\n",
       "      <td>ur.07662606251.28</td>\n",
       "      <td>4.079</td>\n",
       "      <td>26571</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>Gilles Falquet</td>\n",
       "      <td>Jolita Ralyté</td>\n",
       "      <td>ur.012265620367.64</td>\n",
       "      <td>1.436</td>\n",
       "      <td>26571</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Chrislain Razafimahefa</td>\n",
       "      <td>ur.016103437533.00</td>\n",
       "      <td>1.078</td>\n",
       "      <td>4125</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>D. Tsichritzis</td>\n",
       "      <td>ur.013534320626.68</td>\n",
       "      <td>1.039</td>\n",
       "      <td>4125</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Katarzyna Wac</td>\n",
       "      <td>ur.010234164203.55</td>\n",
       "      <td>0.985</td>\n",
       "      <td>4125</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Jean-Henry Morin</td>\n",
       "      <td>Naoufel Cheikhrouhou</td>\n",
       "      <td>ur.016055002233.13</td>\n",
       "      <td>0.865</td>\n",
       "      <td>4125</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>75 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    full_name_author           reviewer_full_name         reviewer_id  score  \\\n",
       "56  Jean-Henry Morin               Gilles Falquet  ur.016167755437.37  4.318   \n",
       "21    Gilles Falquet             Jean-Henry Morin    ur.0631021307.20  4.318   \n",
       "64    Gilles Falquet                Jolita Ralyté  ur.012265620367.64  4.246   \n",
       "70    Gilles Falquet  Jose Luis Fernandez-Marquez  ur.013262732566.50  4.108   \n",
       "49    Gilles Falquet  Giovanna Di Marzo Serugendo   ur.07662606251.28  4.079   \n",
       "..               ...                          ...                 ...    ...   \n",
       "63    Gilles Falquet                Jolita Ralyté  ur.012265620367.64  1.436   \n",
       "16  Jean-Henry Morin       Chrislain Razafimahefa  ur.016103437533.00  1.078   \n",
       "5   Jean-Henry Morin               D. Tsichritzis  ur.013534320626.68  1.039   \n",
       "11  Jean-Henry Morin                Katarzyna Wac  ur.010234164203.55  0.985   \n",
       "1   Jean-Henry Morin         Naoufel Cheikhrouhou  ur.016055002233.13  0.865   \n",
       "\n",
       "    n.louvain p.researcher_id p.full_name  \n",
       "56      26571               0           0  \n",
       "21       4125               0           0  \n",
       "64      26571               0           0  \n",
       "70      26571               0           0  \n",
       "49      26571               0           0  \n",
       "..        ...             ...         ...  \n",
       "63      26571               0           0  \n",
       "16       4125               0           0  \n",
       "5        4125               0           0  \n",
       "11       4125               0           0  \n",
       "1        4125               0           0  \n",
       "\n",
       "[75 rows x 7 columns]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# FINAL result for possible reviewer and if p.researcher_id\n",
    "final_result = result_merged_louvain_inference.merge(co_authors,how=\"left\",left_on=\"reviewer_id\",right_on=\"p.researcher_id\").fillna(\"0\").sort_values(by=\"p.researcher_id\",ascending=False)\n",
    "final_result = final_result.drop(final_result[(final_result[\"p.full_name\"]!=\"0\")].index)\n",
    "\n",
    "final_result.sort_values(by=\"score\",ascending=False)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.9"
  },
  "vscode": {
   "interpreter": {
    "hash": "620819894f6fc06b8d322f87ec535c6cba2fc33658f2b62c920a4b5d35a28df1"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
